Catalogs/РежимыРаботыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>РежимыРаботыСотрудников</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПроизводственныйКалендарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеКалендари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммированныйУчетРабочегоВремени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьРабочейНедели</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьПраздники</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗаполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыЗаполненияГрафиковРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСпособЗаполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыЗаполненияГрафикаРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочихДнейВНеделе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОпределенияНормыСуммированногоУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОпределенияНормыСуммированногоУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикНормыПриСуммированномУчете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РежимыРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШаблонЗаполнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДеньВключенВГрафик</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Смена</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СменыРаботыСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыВремени</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидВремени</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыИспользованияРабочегоВремени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДанныеОРабочихЧасах</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерДняЦикла</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидВремени</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыИспользованияРабочегоВремени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Часов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Смены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Смена</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СменыРаботыСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/РежимыРаботыСотрудников/Forms/ШаблонЗаполнения/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.ШаблонЗаполнения <> Неопределено Тогда
		Для Каждого Смена Из Параметры.ШаблонЗаполнения Цикл
			СтрокаТаблицы = ШаблонЗаполнения.Добавить();
			СтрокаТаблицы.НомерДня = ШаблонЗаполнения.Количество();
			СтрокаТаблицы.Смена = Смена;
		КонецЦикла;
	КонецЕсли;
	
	РежимРаботы = Параметры.РежимРаботы;
	Для Каждого СтрокаСмены Из РежимРаботы.Смены Цикл
		Смены.Добавить(СтрокаСмены.Смена.Ссылка);
	КонецЦикла;
	
	ПараметрыВыбора = Новый Массив;
	ПараметрыВыбора.Добавить(Новый ПараметрВыбора("РежимРаботы", РежимРаботы));
	Элементы.ШаблонЗаполненияСмена.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Модифицированность Тогда 
		ТекстПредупреждения = НСтр("ru = 'Данные были изменены, внесенные изменения будут отменены.
										 |Отменить и закрыть?'");
		ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияПроизвольнойФормы(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, "ДействиеВыбрано");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Ок(Команда)
	Результат = Новый Массив;
	ДействиеВыбрано = Истина;
	Для Каждого СтрокаТаблицы Из ШаблонЗаполнения Цикл
		Результат.Добавить(СтрокаТаблицы.Смена);
	КонецЦикла;	
	
	Закрыть(Результат);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ДействиеВыбрано = Ложь;
	Закрыть(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормШаблонЗаполнения

&НаКлиенте
Процедура ШаблонЗаполненияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.ШаблонЗаполнения.ТекущиеДанные.НомерДня = ШаблонЗаполнения.Количество();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонЗаполненияСменаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Смены.Количество() <> 0 Тогда
		СтандартнаяОбработка = Ложь;
		
		ПараметрыОткрытия = Новый Структура;
		
		НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных;
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(НастройкиКомпоновки.Отбор, "Ссылка",
			ВидСравненияКомпоновкиДанных.ВСписке, Смены);
			
		ПараметрыОткрытия.Вставить("ФиксированныеНастройки", НастройкиКомпоновки);
		
		ОткрытьФорму("Справочник.СменыРаботыСотрудников.ФормаВыбора", ПараметрыОткрытия, Элемент);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
